{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "UserRating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 233], "dtype": "float32", "sparse": false, "ragged": false, "name": "UserRating"}, "inbound_nodes": []}, {"name": "LatentSpace", "class_name": "Dense", "config": {"name": "LatentSpace", "trainable": true, "dtype": "float32", "units": 500, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["UserRating", 0, 0, {}]]]}, {"name": "UserScorePred", "class_name": "Dense", "config": {"name": "UserScorePred", "trainable": true, "dtype": "float32", "units": 233, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["LatentSpace", 0, 0, {}]]]}], "input_layers": [["UserRating", 0, 0]], "output_layers": [["UserScorePred", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}